# IsOpen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Workset..::..IsOpen Property
Workset Class See Also
---
Whether the workset is open (rather than closed).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsOpen { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsOpen As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsOpen {
	bool get ();
}
```

# Remarks
The intent of closing a workset is to ask Revit to not display or expand any element in the workset, to reduce memory usage. Note that open/closed status is independent of editability.
# See Also
Workset Class
Autodesk.Revit.DB Namespace